In [1]:
# Leetcode link:  https://leetcode.com/studyplan/introduction-to-pandas/

#using a simple list
import pandas as pd
lst = [10,20,30,56,78,90]
df = pd.DataFrame(lst)
df

    0
0  10
1  20
2  30
3  56
4  78
5  90

In [2]:
df = pd.DataFrame(lst, index =['a','b','c','d','e','f'],columns=['Marks'])
df

   Marks
a     10
b     20
c     30
d     56
e     78
f     90

In [3]:
# using zip()
list1 = ["Raj","Rajat","Asif","Karan"]
list2 = [56,89,90,34]

list(zip(list1,list2))

# output is list of tuple

[('Raj', 56), ('Rajat', 89), ('Asif', 90), ('Karan', 34)]

In [4]:
df = pd.DataFrame(list(zip(list1,list2)))
df

       0   1
0    Raj  56
1  Rajat  89
2   Asif  90
3  Karan  34

In [5]:
df = pd.DataFrame(list(zip(list1,list2)), columns =["Name","Age"])
df

    Name  Age
0    Raj   56
1  Rajat   89
2   Asif   90
3  Karan   34

In [6]:
# Using MultiDimentional list
# list of list
list = [["a",2],["b",2],["c",3],["d",4]]
df = pd.DataFrame(list, columns=["Alphabets","Integer"])
df

  Alphabets  Integer
0         a        2
1         b        2
2         c        3
3         d        4

In [7]:
#Using Dictionary of list

dictionary = {"Name":["Raj","Rajat","Karan","Tulika","Ronim"], "Marks":[50,60,80,78,90]}
df = pd.DataFrame(dictionary)
df

     Name  Marks
0     Raj     50
1   Rajat     60
2   Karan     80
3  Tulika     78
4   Ronim     90

In [8]:
#Get the Size of a DataFrame
df.size

10

In [9]:
row, cols = df.shape
print("No of rows in DF:",row, "No of cols in df:",cols)

No of rows in DF: 5 No of cols in df: 2

In [10]:
#Display the First Three Rows
df.head(3)

    Name  Marks
0    Raj     50
1  Rajat     60
2  Karan     80

In [11]:
Data = pd.DataFrame({"Student_id":[101,202,303,404,505,606],"Name":["Tina","Trisha","Twinkle","Tina","Lina","Hiya"],"Age":[30,31,23,25,33,36]})
Data

   Student_id     Name  Age
0         101     Tina   30
1         202   Trisha   31
2         303  Twinkle   23
3         404     Tina   25
4         505     Lina   33
5         606     Hiya   36

In [12]:
##select Data 
result = Data[Data["Student_id"]==101][["Name","Age"]]
result

   Name  Age
0  Tina   30

In [13]:
#Create a New Column
Marks = Data["Age"] * 2
Data ["Marks"] = Marks
Data

# add a row
new_row = pd.DataFrame({"Student_id":[505,707],"Name":["Lina","Rina"],"Age":[33,41]})

df = pd.concat([Data,new_row], ignore_index = True)
df

   Student_id     Name  Age  Marks
0         101     Tina   30   60.0
1         202   Trisha   31   62.0
2         303  Twinkle   23   46.0
3         404     Tina   25   50.0
4         505     Lina   33   66.0
5         606     Hiya   36   72.0
6         505     Lina   33    NaN
7         707     Rina   41    NaN

In [16]:
#Drop Duplicate Rows
'''DataFrame.drop_duplicates(subset=None, *, keep='first', inplace=False, ignore_index=False)[source]
Return DataFrame with duplicate rows removed.

Considering certain columns is optional. Indexes, including time indexes are ignored.

Parameters:
subsetcolumn label or sequence of labels, optional
Only consider certain columns for identifying duplicates, by default use all of the columns.

keep{‘first’, ‘last’, False}, default ‘first’
Determines which duplicates (if any) to keep.

‘first’ : Drop duplicates except for the first occurrence.

‘last’ : Drop duplicates except for the last occurrence.

False : Drop all duplicates.

inplacebool, default False
Whether to modify the DataFrame rather than creating a new one.

ignore_indexbool, default False
If True, the resulting axis will be labeled 0, 1, …, n - 1.'''

result = Data.drop_duplicates( keep = 'first')
result

   Student_id     Name  Age  Marks
0         101     Tina   30     60
1         202   Trisha   31     62
2         303  Twinkle   23     46
3         404     Tina   25     50
4         505     Lina   33     66
5         606     Hiya   36     72

In [20]:
#Drop Missing Data
result = Data.dropna(subset = ['Name'])
result

   Student_id     Name  Age  Marks
0         101     Tina   30     60
1         202   Trisha   31     62
2         303  Twinkle   23     46
3         404     Tina   25     50
4         505     Lina   33     66
5         606     Hiya   36     72

In [21]:
#2884. Modify Columns
import pandas as pd

# Example input DataFrame
data = {
    "name": ["Alice", "Bob", "Charlie"],
    "salary": [50000, 60000, 70000]
}
employees = pd.DataFrame(data)

# Modify the salary column by multiplying each salary by 2
employees["salary"] = employees["salary"] * 2

# Display the resulting DataFrame
print(employees)

      name  salary
0    Alice  100000
1      Bob  120000
2  Charlie  140000

In [23]:
#2885. Rename Columns

import pandas as pd

# Example input DataFrame
data = {
    "id": [1, 2, 3],
    "first": ["Alice", "Bob", "Charlie"],
    "last": ["Smith", "Jones", "Brown"],
    "age": [20, 21, 22]
}
students = pd.DataFrame(data)

# Rename the columns
students.rename(columns={
    "id": "student_id",
    "first": "first_name",
    "last": "last_name",
    "age": "age_in_years"
}, inplace=True)

# Display the resulting DataFrame
print(students)

#If inplace=True, the original DataFrame is modified. If you don't want that, set inplace=False and return the modified DataFrame.

   student_id first_name last_name  age_in_years
0           1      Alice     Smith            20
1           2        Bob     Jones            21
2           3    Charlie     Brown            22

In [24]:
import pandas as pd

# Example input DataFrame
data = {
    "student_id": [1, 2, 3],
    "name": ["Alice", "Bob", "Charlie"],
    "age": [20, 21, 22],
    "grade": [85.5, 90.0, 78.3]
}
students = pd.DataFrame(data)

# Convert the 'grade' column from floats to integers
students["grade"] = students["grade"].astype(int)

# Display the resulting DataFrame
print(students)

   student_id     name  age  grade
0           1    Alice   20     85
1           2      Bob   21     90
2           3  Charlie   22     78

In [25]:
#2887. Fill Missing Data
import pandas as pd

# Example DataFrame
data = {
    "name": ["Product A", "Product B", "Product C", "Product D"],
    "quantity": [10, None, 5, None],
    "price": [100, 200, 150, 300],
}
products = pd.DataFrame(data)

# Fill missing values in the quantity column with 0
products["quantity"] = products["quantity"].fillna(0)

# Ensure quantity column is of integer type (optional)
products["quantity"] = products["quantity"].astype(int)

# Display the result
print(products)

        name  quantity  price
0  Product A        10    100
1  Product B         0    200
2  Product C         5    150
3  Product D         0    300

In [26]:

#pivot
import pandas as pd

# Example input DataFrame
data = {
    "city": ["New York", "Los Angeles", "New York", "Los Angeles"],
    "month": ["January", "January", "February", "February"],
    "temperature": [30, 60, 35, 65]
}
weather = pd.DataFrame(data)

# Pivot the DataFrame
pivoted_weather = weather.pivot(index="month", columns="city", values="temperature")

# Display the resulting DataFrame
print(pivoted_weather.reset_index())

city     month  Los Angeles  New York
0     February           65        35
1      January           60        30

In [27]:
#melt

import pandas as pd

# Create the initial DataFrame
data = {
    'product': ['Umbrella', 'SleepingBag'],
    'quarter_1': [417, 800],
    'quarter_2': [224, 936],
    'quarter_3': [379, 93],
    'quarter_4': [611, 875]
}

df = pd.DataFrame(data)

# Reshape the DataFrame using melt
reshaped_df = pd.melt(df, id_vars=['product'], var_name='quarter', value_name='sales')

# Display the reshaped DataFrame
print(reshaped_df)

       product    quarter  sales
0     Umbrella  quarter_1    417
1  SleepingBag  quarter_1    800
2     Umbrella  quarter_2    224
3  SleepingBag  quarter_2    936
4     Umbrella  quarter_3    379
5  SleepingBag  quarter_3     93
6     Umbrella  quarter_4    611
7  SleepingBag  quarter_4    875

In [29]:
# chaining

import pandas as pd

# Sample DataFrame
data = {
    'name': ['Tatiana', 'Khaled', 'Alex', 'Jonathan', 'Stefan', 'Tommy'],
    'species': ['Snake', 'Giraffe', 'Leopard', 'Monkey', 'Bear', 'Panda'],
    'age': [98, 50, 6, 45, 100, 26],
    'weight': [464, 41, 328, 463, 50, 349]
}

df = pd.DataFrame(data)

# One-liner solution using method chaining
result = df[df['weight'] > 100].sort_values(by='weight', ascending=False)['name']

# Display result
print(result)

0     Tatiana
3    Jonathan
5       Tommy
2        Alex
Name: name, dtype: object